rovOsc_s_U0.1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5e-4;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    xmin
    {
        type            fixedValue;
        value           uniform 1.5e-4;
    }

    xmax
    {
        type            inletOutlet;
        inletValue      uniform 1.5e-4;
        value           uniform 1.5e-4;
    }

    "(ymin|ymax|zmin|zmax)"
    {
        type            zeroGradient;
    }

    "BROV2.*"
    {
        type            kqRWallFunction;
        value           uniform 1.5e-4;
    }
}

// ************************************************************************* //
